import ReqSeal from "../lib/reqseal.js";

export const reqSeal = new ReqSeal({
    "1": ["一", "二", "三", "四", '五', '六'],
    "2": ["七", "八", "九", "十", '月', '火'],
    "3": ["水", "木", "金", "土", '日', '天'],
    "4": ["地", "人", "山", "川", '花', '鳥'],
    "5": ["風", "髪", "雪", "星", '空', '海'],
    "6": ["大", "小", "中", "上", '下', '左'],
    "7": ["右", "前", "後", "東", '西', '南'],
    "8": ["北", "国", "家", "町", '村', '道'],
    "9": ["力", "男", "女", "子", '学', '生'],
    "0": ["見", "聞", "言", "話", '読', '書'],
}, {
    debug: true, // take [false] for true testing test-4
});